tutorials/viscoelastic/viscoelasticFluidFoam/DCPP/Allrun
#!/bin/sh

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=`getApplication`

 echo "Running blockMesh application"
 runApplication blockMesh

 echo "Running viscoelasticFluidFoam solver"
 echo "DCPP model: execution time ~ 41830 s in a Core 2 Duo 2.0 Ghz processor"
 runApplication $application

 echo "Running PSD application"
 runApplication PSD

 echo "Running sample application"
 runApplication sample

 echo "done!"
